krapyv/stm32-i2c-driver/i2c.c
#include <stdint.h>
#include <stdio.h>
#include "i2c.h"
#include "stm32f411.h"
#include "core_cm4.h"
#include "systick.h"

void I2C_Reinit(void)
{
    // explicitly disable PE (bit 0 CR1) to prevet undefined hardware behavior
    // if the PE is already 1 after reboot or SWRST recovery
    hi2c.Instance->CR1 &= ~(1 << 0);

    // set the bit 15 to 0 (Sm mode I2C)
    hi2c.Instance->CCR &= ~(1 << 15);

    // set the CCR [11:0] to 80 = 0x50, since CCR = T_high / T_pclk1
    // where T_high = 5000 ns, T_pclk1 = 62.5 ns (1 / 16 000 000)

    // clear the range 11:0
    // 111111111111 = 0xFF
    hi2c.Instance->CCR &= ~(0xFFF << 0);

    // set the range to 0x50
    hi2c.Instance->CCR |= (0x50 << 0);

    // set FREQ[5:0] (Peripheral clock frequency) in CR2
    // clear the bits
    // 111111 = 2^5 + 2^4 + 2^3 + 2^2 + 2^1 + 2^0 = 32 + 16 + 8 + 4 + 2 + 1 = 48 + 15 = 63 = 0x3F
    hi2c.Instance->CR2 &= ~(0x3F << 0);

    // set the bits
    // 16 MHz = 010000 = 0x10
    hi2c.Instance->CR2 |= (0x10 << 0);

    /* ----- TRISE configuration ----- */
    // set the bits 5:0 to 17 = 0x11
    // 1000 ns / 62.5 + 1 = 16 + 1 = 17

    // clear the range
    // 111111 = 2^5 + 2^4 + 2^3 + 2^2 + 2^1 + 2^0 = 32 + 16 + 8 + 4 + 2 + 1 = 40 + 20 + 3 = 63 = 0x3F
    hi2c.Instance->TRISE &= ~(0x3F << 0);

    // set the range to 0x11
    hi2c.Instance->TRISE |= (0x11 << 0);

    // ----- CR1 configuration ----- //

    // set bit 0 PE (Peripheral enabled) to 1

    hi2c.Instance->CR1 |= (1 << 0);

    // set bit 10 ACK (Acknowledge enable) to 1
    // since this bit is set and cleared by software and cleared by hardware when PE = 0
    // it is enabled after PE became 1
    hi2c.Instance->CR1 |= (1 << 10);

    /* ----- Interrupts enablement (CR2) -----*/

    // set ITERREN (Error interrupt enable) Bit 8 to 1
    hi2c.Instance->CR2 |= (1 << 8);

    // set ITEVTEN (Event interrupt enable) Bit 9 to 1
    hi2c.Instance->CR2 |= (1 << 9);
}

// Events Interrupt Handler (priority 38 - cannot be preempted by I2C1_ER)
void I2C1_EV_IRQHandler(void)
{
    // if the state is ERROR, return
    if ((hi2c.state == I2C_STATE_ERROR) || (hi2c.state == I2C_STATE_IDLE) || (hi2c.state == I2C_STATE_DONE) || (hi2c.state == I2C_STATE_FINISHING))
    {
        return;
    }

    uint16_t sr1_snapshot = hi2c.Instance->SR1;
    uint16_t cr1_snapshot = hi2c.Instance->CR1;
    uint16_t cr2_snapshot = hi2c.Instance->CR2;
    uint32_t dummy = 0;

    // SB bit 0 in SR1 caused interrupt
    if (sr1_snapshot & (1 << 0))
    {
        hi2c.sb_hits++;
        // clear the SB by reading SR1 (already done by creating snapshot)
        // following by writing the DR register with the slave's address (7 bits) + W (0)/R (1) bit
        switch (hi2c.mode)
        {
        case I2C_TX:
            // use W (0), so clear the bit 0th
            hi2c.Instance->DR = (hi2c.slave_add << 1) & ~(0x01);
            hi2c.state = I2C_STATE_TX_ADDR;
            break;
        case I2C_RX:
            // use R (1), so set the bit 0th to 1
            hi2c.Instance->DR = (hi2c.slave_add << 1) | 0x01;
            hi2c.state = I2C_STATE_RX_ADDR;
            break;
        case I2C_TX_RX:
            if (hi2c.phase == I2C_TX_RX_WRITE)
            {
                // use W (0), so clear the bit 0th
                hi2c.Instance->DR = (hi2c.slave_add << 1) & ~(0x01);
                hi2c.state = I2C_STATE_TX_ADDR;
            }
            else
            {
                // use R (1), so set the bit 0th to 1
                hi2c.Instance->DR = (hi2c.slave_add << 1) | 0x01;
                hi2c.state = I2C_STATE_RX_ADDR;
            }
            break;
        }
    }
    // ADDR bit 1 in SR1 caused interrupt
    else if (sr1_snapshot & (1 << 1))
    {
        switch (hi2c.state)
        {
        // transmit phase
        case I2C_STATE_TX_ADDR:
            // after the ADDR is set, clear it
            // read SR2, since SR1 has already been read
            dummy = hi2c.Instance->SR2;
            (void)dummy;

            // enable ITBUFEN
            hi2c.Instance->CR2 |= (1 << 10);
            break;

        case I2C_STATE_RX_ADDR:
            // N = 1 case
            if (hi2c.RxLength == 1)
            {
                // need to clear the ACK before ADDR clear

                // clear the ACK
                hi2c.Instance->CR1 &= ~(1 << 10);

                // clear the ADDR by reading SR2 (SR1 has already been read)
                dummy = hi2c.Instance->SR2;
                (void)dummy;

                // then set the STOP to 1, because since we have 1 byte to get, we need the STOP immediately after it
                hi2c.Instance->CR1 |= (1 << 9);

                // enable ITBUFEN
                hi2c.Instance->CR2 |= (1 << 10);
            }
            // N = 2 case
            else if (hi2c.RxLength == 2)
            {
                // need to set POS = 1 and ACK = 0 before ADDR clear

                // first of all, set POS (bit 11 in CR1) to 1
                // POS = 1 - ACK bit controls the (N)ACK of the next byte with is received in the shift register
                hi2c.Instance->CR1 |= (1 << 11);

                // clear the ACK (bit 10 in CR1)
                // to prepare the NACK pulse for the last second byte
                hi2c.Instance->CR1 &= ~(1 << 10);

                // ADDR clear
                dummy = hi2c.Instance->SR2;
                (void)dummy;
            }
            // N >= 3 case
            else
            {
                // after the ADDR is set, clear it
                // read SR2, since SR1 has already been read
                dummy = hi2c.Instance->SR2;
                (void)dummy;

                // enable ITBUFEN
                hi2c.Instance->CR2 |= (1 << 10);
            }

            break;
        }
    }
    // BTF bit 2 in SR1 caused interrupt
    // we are checking if the BTF is set
    else if (sr1_snapshot & (1 << 2))
    {
        // START was issued, but still unconfirmed

        // since the BTF flag is cleared by hardware once START or STOP condition is detected on the bus
        // and in I2C_TX_RX case we are not explicitly clearing the BTF but just issuing the REPEATED START
        // after the ISR exit, the BTF flag is still set.
        // the ISR immediately reenters itself and hits the BTF once again for the same stale BTF flag

        // the guard discards all the stale BTF entries
        // the REPEATED START races a stale BTF 9 times out of 19 per cycles

        // the I2C_Master_* functions that issue START have I2C_PollHardwareBusy that takes up to 4 ms of time, so there are almost no races at all
        // the ISR issuing START has no time-buffer at all

        // the issue is just frequent and cosmetical, no side effects if the guard is present
        // TODO: see the timing issue and try to solve it
        if (hi2c.state == I2C_STATE_START_PENDING)
        {
            hi2c.start_pending_hits++;
            return;
        }

