krapyv/stm32-i2c-driver/i2c.c
        switch (hi2c.mode)
        {
        case I2C_TX:
            // we have sent bytes from 0 to TxLength - 1, so TxLength bytes
            if (hi2c.index == hi2c.TxLength)
            {
                hi2c.stop_hits++;
                // issue STOP
                hi2c.Instance->CR1 |= (1 << 9);

                hi2c.state = I2C_STATE_FINISHING;
            }
            else
            {
                if (hi2c.index == hi2c.TxLength - 1)
                {
                    // disable ITBUFEN
                    hi2c.Instance->CR2 &= ~(1 << 10);
                }
                hi2c.Instance->DR = hi2c.pTxBuffPtr[hi2c.index++];
            }
            break;

        case I2C_RX:
            // N = 1: no BTF is possible (shift register never fills with nothing behind it)
            // N = 2 case
            if (hi2c.RxLength == 2)
            {
                // after BTF is read, we have the byte 1 in the DR, the byte 2 in the shift register

                // issue STOP
                hi2c.Instance->CR1 |= (1 << 9);

                // read both bytes (after the byte 1 is read, the byte 2 immediately drops from shift register to the DR)
                hi2c.pRxBuffPtr[0] = hi2c.Instance->DR; // byte 1
                hi2c.pRxBuffPtr[1] = hi2c.Instance->DR; // byte 2

                // after both bytes have been read, clear POS
                hi2c.Instance->CR1 &= ~(1 << 11);

                // after all bytes have been read, re-enable the ACK bit in CR1
                hi2c.Instance->CR1 |= (1 << 10);

                hi2c.state = I2C_STATE_FINISHING;
            }
            else if (hi2c.RxLength >= 3)
            {
                if (hi2c.index == hi2c.RxLength - 3)
                {
                    // if BTF is fired, byte N - 2 in DR, byte N - 1 in shift register

                    // clear ACK bit 10 in CR1
                    hi2c.Instance->CR1 &= ~(1 << 10);

                    // read data N-2
                    hi2c.pRxBuffPtr[hi2c.index] = hi2c.Instance->DR;
                    hi2c.index++;

                    break;
                }

                else if (hi2c.index == hi2c.RxLength - 2)
                {
                    // if BTF is fired, byte N - 1 in DR, byte N in shift register

                    // set STOP high (we have all the bytes we need)
                    hi2c.Instance->CR1 |= (1 << 9);

                    // read bytes N - 1 and N
                    hi2c.pRxBuffPtr[hi2c.index++] = hi2c.Instance->DR; // N - 1

                    hi2c.pRxBuffPtr[hi2c.index] = hi2c.Instance->DR; // N

                    // after all bytes have been read, re-enable the ACK bit in CR1
                    hi2c.Instance->CR1 |= (1 << 10);

                    hi2c.state = I2C_STATE_FINISHING;
                }
                else
                {
                    // fallback
                    // the byte is in DR, the byte is in the shift register, but it is not tail end indexes

                    // read the byte in DR
                    hi2c.pRxBuffPtr[hi2c.index] = hi2c.Instance->DR;

                    hi2c.index++;
                }
            }
            break;

        case I2C_TX_RX:
            if (hi2c.phase == I2C_TX_RX_WRITE)
            {
                // enable ITBUFEN
                if (hi2c.RxLength == 1 || hi2c.RxLength >= 3)
                {
                    hi2c.Instance->CR2 |= (1 << 10);
                }
                // repeated start
                hi2c.Instance->CR1 |= (1 << 8);
                // reset index
                hi2c.index = 0;

                // flip the phase value
                hi2c.phase = I2C_TX_RX_READ;

                hi2c.state = I2C_STATE_START_PENDING;
            }
            else if (hi2c.phase == I2C_TX_RX_READ)
            {
                // N = 1: no BTF is possible (shift register never fills with nothing behind it)
                // N = 2 case
                if (hi2c.RxLength == 2)
                {
                    // after BTF is read, we have the byte 1 in the DR, the byte 2 in the shift register

                    // issue STOP
                    hi2c.Instance->CR1 |= (1 << 9);

                    // read both bytes (after the byte 1 is read, the byte 2 immediately drops from shift register to the DR)
                    hi2c.pRxBuffPtr[0] = hi2c.Instance->DR; // byte 1
                    hi2c.pRxBuffPtr[1] = hi2c.Instance->DR; // byte 2

                    // after both bytes have been read, clear POS
                    hi2c.Instance->CR1 &= ~(1 << 11);

                    // after all bytes have been read, re-enable the ACK bit in CR1
                    hi2c.Instance->CR1 |= (1 << 10);

                    hi2c.state = I2C_STATE_FINISHING;
                }
                else if (hi2c.RxLength >= 3)
                {
                    if (hi2c.index == hi2c.RxLength - 3)
                    {
                        // if BTF is fired, byte N - 2 in DR, byte N - 1 in shift register

                        // clear ACK bit 10 in CR1
                        hi2c.Instance->CR1 &= ~(1 << 10);

                        // read data N-2
                        hi2c.pRxBuffPtr[hi2c.index] = hi2c.Instance->DR;
                        hi2c.index++;

                        break;
                    }

                    else if (hi2c.index == hi2c.RxLength - 2)
                    {
                        // if BTF is fired, byte N - 1 in DR, byte N in shift register

                        // set STOP high (we have all the bytes we need)
                        hi2c.Instance->CR1 |= (1 << 9);

                        // read bytes N - 1 and N
                        hi2c.pRxBuffPtr[hi2c.index++] = hi2c.Instance->DR; // N - 1

                        hi2c.pRxBuffPtr[hi2c.index] = hi2c.Instance->DR; // N

                        // after all bytes have been read, re-enable the ACK bit in CR1
                        hi2c.Instance->CR1 |= (1 << 10);

                        hi2c.state = I2C_STATE_FINISHING;
                    }

                    else
                    {
                        // fallback
                        // the byte is in DR, the byte is in the shift register, but it is not tail end indexes

                        // read the byte in DR
                        hi2c.pRxBuffPtr[hi2c.index] = hi2c.Instance->DR;

                        hi2c.index++;
                    }
                }
            }

            break;
        }
    }

    // RxNE bit 6 in SR1 caused interrupt
    else if (sr1_snapshot & (1 << 6))
    {

        if (hi2c.RxLength == 1)
        {
            hi2c.stop_hits++;
            // stop is already set after the clearing of the ADDR

