krapyv/stm32-i2c-driver/i2c.c
I2C_Status_t I2C_Master_Transmit_Receive(uint8_t slave_addr, uint8_t *pSend, uint8_t *pReceive, uint8_t send_length, uint8_t receive_length)
{
    if (hi2c.Instance == NULL || pSend == NULL || pReceive == NULL || send_length == 0 || receive_length == 0)
    {
        return I2C_ERROR;
    }

    hi2c.slave_add = slave_addr;
    hi2c.pTxBuffPtr = pSend;
    hi2c.TxLength = send_length;
    hi2c.pRxBuffPtr = pReceive;
    hi2c.RxLength = receive_length;
    hi2c.mode = I2C_TX_RX;
    hi2c.phase = I2C_TX_RX_WRITE;
    hi2c.index = 0;
    hi2c.error_code = 0;

    // wait until the bus is completely idle (BUSY == 0)
    if (I2C_PollHardwareBusy(hi2c.Instance))
    {
        return I2C_ERROR;
    }

    hi2c.state = I2C_STATE_START_PENDING;
    // Master issues the Start condition
    hi2c.Instance->CR1 |= (1 << 8);
    // the hardware clears this bit when the start is sent

    return I2C_OK;
}

void I2C_PollStopConfirmation()
{
    uint32_t start = SysTick_GetTick();
    uint8_t success = 0;

    while ((SysTick_GetTick() - start) <= 2)
    {
        // BUSY bit 1 polling
        if (!(hi2c.Instance->SR2 & (1 << 1)))
        {
            // if it is 0, the STOP is detected, the lines are settled
            success = 1;
            break;
        }
    }

    if (success)
    {
        hi2c.state = I2C_STATE_DONE;
    }
    else
    {
        // in reality it is a software-detected STOP-confirmation timeout, not a real BERR
        hi2c.error_code = I2C_ERROR_BERR;
        hi2c.state = I2C_STATE_ERROR;
    }

    return;
}

void I2C_Process(void)
{
    // Firstly read index, then state
    uint8_t current_index = hi2c.index;

    I2C_State_t current_state = hi2c.state;

    if (current_state == I2C_STATE_FINISHING)
    {
        I2C_PollStopConfirmation();
    }

    else if (current_state == I2C_STATE_ERROR)
    {
        if (hi2c.error_code & I2C_ERROR_BERR)
        {
            // the SWRST is already 1 and not yet cleared

            // we need to check if the lines are released and the bus is free
            // for that, we need to check GPIO_IDR values for the pins
            uint32_t bus_is_free = 0;

            uint32_t sda_val = 0;
            uint32_t scl_val = 0;

            uint32_t start = SysTick_GetTick();

            while ((SysTick_GetTick() - start) <= 2)
            {
                sda_val = hi2c.sda_port->IDR & (1 << hi2c.sda_pin);
                scl_val = hi2c.scl_port->IDR & (1 << hi2c.scl_pin);

                // if the lines both are 1, then the bus is naturally free
                if (sda_val && scl_val)
                {
                    bus_is_free = 1;
                    break;
                }
            }

            // the waiting IDR loop exits and bus is still not free
            if (!bus_is_free)
            {
                // gpio clock-banging

                // first of all, change the MODER for SCL and SDA lines

                // 1.  SCL to General purpose output mode (01)

                uint8_t bus_released = 0;

                // clear the bits (each pin has 2 bits)
                // 0b0011 = 2^1 + 2^0 = 3 = 0x3
                hi2c.scl_port->MODER &= ~(0x3 << (hi2c.scl_pin * 2));

                // set the bits
                // 01 = 2^0 = 1 = 0x1
                hi2c.scl_port->MODER |= (0x1 << (hi2c.scl_pin * 2));

                // make sure the SCL has OTYPER at Open-Drain
                hi2c.scl_port->OTYPER |= (1 << hi2c.scl_pin);

                // 2. SDA to Input (00)
                // we just want to read the true state of the wire
                hi2c.sda_port->MODER &= ~(0x3 << (hi2c.sda_pin * 2));

                // make sure the SCL line is high
                hi2c.scl_port->BSRR = (1 << hi2c.scl_pin);
                // BSRR (Bit Set/Reset Register) allows to change the state of individual pins atomically (in a single CPU instruction cycle) without using a read-modify-write operation

                // a small delay to give time electrical changes to occur on the bus
                for (volatile uint32_t i = 0; i < 50; i++)
                    ;

                // manually toggle SCL via GPIO to walk the slave's internal shift counter forward uint it releases SDA
                for (uint8_t i = 0; i < 9; i++)
                {
                    // check if the SDA is not released
                    if (hi2c.sda_port->IDR & (1 << hi2c.sda_pin))
                    {
                        // if released, exit early
                        bus_released = 1;
                        break;
                    }

                    // pull the SCL line low to step forward in the slave's internal state machine
                    hi2c.scl_port->BSRR = (1 << (hi2c.scl_pin + 16));

                    for (volatile uint32_t i = 0; i < 50; i++)
                        ;

                    // release the SCL line high
                    hi2c.scl_port->BSRR = (1 << hi2c.scl_pin);

                    for (volatile uint32_t i = 0; i < 50; i++)
                        ;
                }

                if (bus_released)
                {
                    // generate stop
                    // STOP sequence: SCL goes low, SDA goes low, SCL goes high, SDA goes high

                    // first of all, configure the SDA pin as General Purpose Output (01)

                    // clear the bits (a pin has 2 bits in MODER)
                    // 0b0011 = 0x3
                    hi2c.sda_port->MODER &= ~(0x3 << (hi2c.sda_pin * 2));

                    // set the bits
                    // 0b0001 = 0x1
                    hi2c.sda_port->MODER |= (0x1 << (hi2c.sda_pin * 2));

                    // make sure that SDA pin is Open-Drain
                    hi2c.sda_port->OTYPER |= (1 << hi2c.sda_pin);

                    /* ----- SEQUENCE -----*/
                    // SCL goes low
                    hi2c.scl_port->BSRR = (1 << (hi2c.scl_pin + 16));
                    for (volatile uint32_t i = 0; i < 50; i++)
                        ;

                    // SDA goes low
                    hi2c.sda_port->BSRR = (1 << (hi2c.sda_pin + 16));
                    for (volatile uint32_t i = 0; i < 50; i++)
                        ;

